In [2]:
# https://python-course.eu/numerical-programming/pandas-dataframe.php

In [3]:
import pandas as pd

years = range(2014, 2018)

shop1 = pd.Series([2409.14, 2941.01, 3496.83, 3119.55], index=years)
shop2 = pd.Series([1203.45, 3441.62, 3007.83, 3619.53], index=years)
shop3 = pd.Series([3412.12, 3491.16, 3457.19, 1963.10], index=years)

In [4]:
pd.concat([shop1, shop2, shop3])

2014    2409.14
2015    2941.01
2016    3496.83
2017    3119.55
2014    1203.45
2015    3441.62
2016    3007.83
2017    3619.53
2014    3412.12
2015    3491.16
2016    3457.19
2017    1963.10
dtype: float64

In [5]:
shops_df = pd.concat([shop1, shop2, shop3], axis=1)
shops_df

            0        1        2
2014  2409.14  1203.45  3412.12
2015  2941.01  3441.62  3491.16
2016  3496.83  3007.83  3457.19
2017  3119.55  3619.53  1963.10

In [6]:
cities = ["Zürich", "Winterthur", "Freiburg"]
shops_df.columns = cities 
print(shops_df)

       Zürich  Winterthur  Freiburg
2014  2409.14     1203.45   3412.12
2015  2941.01     3441.62   3491.16
2016  3496.83     3007.83   3457.19
2017  3119.55     3619.53   1963.10

In [7]:
# alternative way: give names to series:
shop1.name = "Zürich"
shop2.name = "Winterthur"
shop3.name = "Freiburg"

print("------")
shops_df2 = pd.concat([shop1, shop2, shop3], axis=1)
print(shops_df2)

------
       Zürich  Winterthur  Freiburg
2014  2409.14     1203.45   3412.12
2015  2941.01     3441.62   3491.16
2016  3496.83     3007.83   3457.19
2017  3119.55     3619.53   1963.10

In [8]:
print(type(shops_df))

<class 'pandas.core.frame.DataFrame'>

In [9]:
cities = {"name": ["London", "Berlin", "Madrid", "Rome", 
                   "Paris", "Vienna", "Bucharest", "Hamburg", 
                   "Budapest", "Warsaw", "Barcelona", 
                   "Munich", "Milan"],
          "population": [8615246, 3562166, 3165235, 2874038,
                         2273305, 1805681, 1803425, 1760433,
                         1754000, 1740119, 1602386, 1493900,
                         1350680],
          "country": ["England", "Germany", "Spain", "Italy",
                      "France", "Austria", "Romania", 
                      "Germany", "Hungary", "Poland", "Spain",
                      "Germany", "Italy"]}

city_frame = pd.DataFrame(cities)
city_frame

         name  population  country
0      London     8615246  England
1      Berlin     3562166  Germany
2      Madrid     3165235    Spain
3        Rome     2874038    Italy
4       Paris     2273305   France
5      Vienna     1805681  Austria
6   Bucharest     1803425  Romania
7     Hamburg     1760433  Germany
8    Budapest     1754000  Hungary
9      Warsaw     1740119   Poland
10  Barcelona     1602386    Spain
11     Munich     1493900  Germany
12      Milan     1350680    Italy

In [10]:
ordinals = ["first", "second", "third", "fourth",
            "fifth", "sixth", "seventh", "eigth",
            "ninth", "tenth", "eleventh", "twelvth",
            "thirteenth"]
city_frame = pd.DataFrame(cities, index=ordinals)
city_frame

                 name  population  country
first          London     8615246  England
second         Berlin     3562166  Germany
third          Madrid     3165235    Spain
fourth           Rome     2874038    Italy
fifth           Paris     2273305   France
sixth          Vienna     1805681  Austria
seventh     Bucharest     1803425  Romania
eigth         Hamburg     1760433  Germany
ninth        Budapest     1754000  Hungary
tenth          Warsaw     1740119   Poland
eleventh    Barcelona     1602386    Spain
twelvth        Munich     1493900  Germany
thirteenth      Milan     1350680    Italy

In [11]:
city_frame = pd.DataFrame(cities,
                          columns=["name", 
                                   "country", 
                                   "population"])
city_frame

         name  country  population
0      London  England     8615246
1      Berlin  Germany     3562166
2      Madrid    Spain     3165235
3        Rome    Italy     2874038
4       Paris   France     2273305
5      Vienna  Austria     1805681
6   Bucharest  Romania     1803425
7     Hamburg  Germany     1760433
8    Budapest  Hungary     1754000
9      Warsaw   Poland     1740119
10  Barcelona    Spain     1602386
11     Munich  Germany     1493900
12      Milan    Italy     1350680

In [12]:
city_frame.reindex(index=[0, 2, 4, 6,  8, 10, 12, 1, 3, 5, 7, 9, 11], 
                   columns=['country', 'name', 'population'])

    country       name  population
0   England     London     8615246
2     Spain     Madrid     3165235
4    France      Paris     2273305
6   Romania  Bucharest     1803425
8   Hungary   Budapest     1754000
10    Spain  Barcelona     1602386
12    Italy      Milan     1350680
1   Germany     Berlin     3562166
3     Italy       Rome     2874038
5   Austria     Vienna     1805681
7   Germany    Hamburg     1760433
9    Poland     Warsaw     1740119
11  Germany     Munich     1493900

In [13]:
city_frame.rename(columns={"name":"Soyadı", 
                           "country":"Ülke", 
                           "population":"Nüfus"},
                 inplace=True)
city_frame

       Soyadı     Ülke    Nüfus
0      London  England  8615246
1      Berlin  Germany  3562166
2      Madrid    Spain  3165235
3        Rome    Italy  2874038
4       Paris   France  2273305
5      Vienna  Austria  1805681
6   Bucharest  Romania  1803425
7     Hamburg  Germany  1760433
8    Budapest  Hungary  1754000
9      Warsaw   Poland  1740119
10  Barcelona    Spain  1602386
11     Munich  Germany  1493900
12      Milan    Italy  1350680

In [14]:
city_frame = pd.DataFrame(cities,
                          columns=["name", "population"],
                          index=cities["country"])

city_frame

              name  population
England     London     8615246
Germany     Berlin     3562166
Spain       Madrid     3165235
Italy         Rome     2874038
France       Paris     2273305
Austria     Vienna     1805681
Romania  Bucharest     1803425
Germany    Hamburg     1760433
Hungary   Budapest     1754000
Poland      Warsaw     1740119
Spain    Barcelona     1602386
Germany     Munich     1493900
Italy        Milan     1350680

In [15]:
city_frame = pd.DataFrame(cities, 
                          columns=("name", "population"), 
                          index=cities["country"])
print(city_frame.loc["Germany"])

            name  population
Germany   Berlin     3562166
Germany  Hamburg     1760433
Germany   Munich     1493900

In [16]:
print(city_frame.loc[["Germany", "France"]])

            name  population
Germany   Berlin     3562166
Germany  Hamburg     1760433
Germany   Munich     1493900
France     Paris     2273305

In [17]:
condition = city_frame.population>2000000
print(city_frame.loc[condition])

           name  population
England  London     8615246
Germany  Berlin     3562166
Spain    Madrid     3165235
Italy      Rome     2874038
France    Paris     2273305

In [18]:
condition1 = (city_frame.population>1500000)
condition2 = (city_frame['name'].str.contains("m"))
print(city_frame.loc[condition1 & condition2])

            name  population
Italy       Rome     2874038
Germany  Hamburg     1760433

In [19]:
condition1 = (city_frame.population>3000000)
condition2 = (city_frame['name'].str.contains("m"))
print(city_frame.loc[condition1 | condition2])

            name  population
England   London     8615246
Germany   Berlin     3562166
Spain     Madrid     3165235
Italy       Rome     2874038
Germany  Hamburg     1760433

In [20]:
milan = ['Milan', 1399860]
city_frame.iloc[-1] = milan
city_frame.loc['Switzerland'] = ['Zurich', 415215]
city_frame

                  name  population
England         London     8615246
Germany         Berlin     3562166
Spain           Madrid     3165235
Italy             Rome     2874038
France           Paris     2273305
Austria         Vienna     1805681
Romania      Bucharest     1803425
Germany        Hamburg     1760433
Hungary       Budapest     1754000
Poland          Warsaw     1740119
Spain        Barcelona     1602386
Germany         Munich     1493900
Italy            Milan     1399860
Switzerland     Zurich      415215

In [21]:
df = city_frame.iloc[3]
print(df)

name             Rome
population    2874038
Name: Italy, dtype: object

In [22]:
df = city_frame.iloc[[3, 2, 0, 5, 0]]
print(df)

           name  population
Italy      Rome     2874038
Spain    Madrid     3165235
England  London     8615246
Austria  Vienna     1805681
England  London     8615246

In [23]:
import numpy as np

years = range(2014, 2019)
cities = ["Zürich", "Freiburg", "München", "Konstanz", "Saarbrücken"]
shops = pd.DataFrame(index=years)
for city in cities:
    shops.insert(loc=len(shops.columns),
                 column=city,
                 value=(np.random.uniform(0.7, 1, (5,)) * 1000).round(2))
    
print(shops)

      Zürich  Freiburg  München  Konstanz  Saarbrücken
2014  780.74    786.50   883.79    821.62       749.09
2015  985.19    873.07   940.09    818.41       779.19
2016  870.47    706.95   939.99    760.13       773.73
2017  747.52    799.52   977.00    795.85       932.21
2018  767.62    714.36   706.17    899.61       953.74

In [24]:
shops.sum()

Zürich         4151.54
Freiburg       3880.40
München        4447.04
Konstanz       4095.62
Saarbrücken    4187.96
dtype: float64

In [25]:
shops.sum(axis=1)

2014    4021.74
2015    4395.95
2016    4051.27
2017    4252.10
2018    4041.50
dtype: float64

In [26]:
s = shops.iloc[:, [0, 2, -1]]
print(s)
print("and now the sum:")
print(s.sum())

      Zürich  München  Saarbrücken
2014  780.74   883.79       749.09
2015  985.19   940.09       779.19
2016  870.47   939.99       773.73
2017  747.52   977.00       932.21
2018  767.62   706.17       953.74
and now the sum:
Zürich         4151.54
München        4447.04
Saarbrücken    4187.96
dtype: float64

In [27]:
shops[["Zürich", "München", "Saarbrücken"]].sum()

Zürich         4151.54
München        4447.04
Saarbrücken    4187.96
dtype: float64

In [28]:
x = shops.cumsum()
print(x)

       Zürich  Freiburg  München  Konstanz  Saarbrücken
2014   780.74    786.50   883.79    821.62       749.09
2015  1765.93   1659.57  1823.88   1640.03      1528.28
2016  2636.40   2366.52  2763.87   2400.16      2302.01
2017  3383.92   3166.04  3740.87   3196.01      3234.22
2018  4151.54   3880.40  4447.04   4095.62      4187.96

In [29]:
x = shops.cumsum(axis=1)
print(x)

      Zürich  Freiburg  München  Konstanz  Saarbrücken
2014  780.74   1567.24  2451.03   3272.65      4021.74
2015  985.19   1858.26  2798.35   3616.76      4395.95
2016  870.47   1577.42  2517.41   3277.54      4051.27
2017  747.52   1547.04  2524.04   3319.89      4252.10
2018  767.62   1481.98  2188.15   3087.76      4041.50

In [30]:
cities = {"name": ["London", "Berlin", "Madrid", "Rome", 
                   "Paris", "Vienna", "Bucharest", "Hamburg", 
                   "Budapest", "Warsaw", "Barcelona", 
                   "Munich", "Milan"],
          "population": [8615246, 3562166, 3165235, 2874038,
                         2273305, 1805681, 1803425, 1760433,
                         1754000, 1740119, 1602386, 1493900,
                         1350680],
          "country": ["England", "Germany", "Spain", "Italy",
                      "France", "Austria", "Romania", 
                      "Germany", "Hungary", "Poland", "Spain",
                      "Germany", "Italy"]}

city_frame = pd.DataFrame(cities,
                          columns=["country", 
                                   "population",
                                   "cum_population"],
                          index=cities["name"])

city_frame

           country  population cum_population
London     England     8615246            NaN
Berlin     Germany     3562166            NaN
Madrid       Spain     3165235            NaN
Rome         Italy     2874038            NaN
Paris       France     2273305            NaN
Vienna     Austria     1805681            NaN
Bucharest  Romania     1803425            NaN
Hamburg    Germany     1760433            NaN
Budapest   Hungary     1754000            NaN
Warsaw      Poland     1740119            NaN
Barcelona    Spain     1602386            NaN
Munich     Germany     1493900            NaN
Milan        Italy     1350680            NaN

In [31]:
city_frame["cum_population"] = city_frame["population"].cumsum()
city_frame

           country  population  cum_population
London     England     8615246         8615246
Berlin     Germany     3562166        12177412
Madrid       Spain     3165235        15342647
Rome         Italy     2874038        18216685
Paris       France     2273305        20489990
Vienna     Austria     1805681        22295671
Bucharest  Romania     1803425        24099096
Hamburg    Germany     1760433        25859529
Budapest   Hungary     1754000        27613529
Warsaw      Poland     1740119        29353648
Barcelona    Spain     1602386        30956034
Munich     Germany     1493900        32449934
Milan        Italy     1350680        33800614

In [33]:
# in a dictionary-like way:
print(city_frame["population"])

London       8615246
Berlin       3562166
Madrid       3165235
Rome         2874038
Paris        2273305
Vienna       1805681
Bucharest    1803425
Hamburg      1760433
Budapest     1754000
Warsaw       1740119
Barcelona    1602386
Munich       1493900
Milan        1350680
Name: population, dtype: int64

In [34]:
# as an attribute
print(city_frame.population)

London       8615246
Berlin       3562166
Madrid       3165235
Rome         2874038
Paris        2273305
Vienna       1805681
Bucharest    1803425
Hamburg      1760433
Budapest     1754000
Warsaw       1740119
Barcelona    1602386
Munich       1493900
Milan        1350680
Name: population, dtype: int64

In [35]:
city_frame["area"] = 1572
print(city_frame)

           country  population  cum_population  area
London     England     8615246         8615246  1572
Berlin     Germany     3562166        12177412  1572
Madrid       Spain     3165235        15342647  1572
Rome         Italy     2874038        18216685  1572
Paris       France     2273305        20489990  1572
Vienna     Austria     1805681        22295671  1572
Bucharest  Romania     1803425        24099096  1572
Hamburg    Germany     1760433        25859529  1572
Budapest   Hungary     1754000        27613529  1572
Warsaw      Poland     1740119        29353648  1572
Barcelona    Spain     1602386        30956034  1572
Munich     Germany     1493900        32449934  1572
Milan        Italy     1350680        33800614  1572

In [36]:
# area in square km:
area = [1572, 891.85, 605.77, 1285, 
        105.4, 414.6, 228, 755, 
        525.2, 517, 101.9, 310.4, 
        181.8]
# area could have been designed as a list, a Series, an array or a scalar   

city_frame["area"] = area
print(city_frame)

           country  population  cum_population     area
London     England     8615246         8615246  1572.00
Berlin     Germany     3562166        12177412   891.85
Madrid       Spain     3165235        15342647   605.77
Rome         Italy     2874038        18216685  1285.00
Paris       France     2273305        20489990   105.40
Vienna     Austria     1805681        22295671   414.60
Bucharest  Romania     1803425        24099096   228.00
Hamburg    Germany     1760433        25859529   755.00
Budapest   Hungary     1754000        27613529   525.20
Warsaw      Poland     1740119        29353648   517.00
Barcelona    Spain     1602386        30956034   101.90
Munich     Germany     1493900        32449934   310.40
Milan        Italy     1350680        33800614   181.80

In [37]:
city_frame = city_frame.sort_values(by="area", ascending=False)
print(city_frame)

           country  population  cum_population     area
London     England     8615246         8615246  1572.00
Rome         Italy     2874038        18216685  1285.00
Berlin     Germany     3562166        12177412   891.85
Hamburg    Germany     1760433        25859529   755.00
Madrid       Spain     3165235        15342647   605.77
Budapest   Hungary     1754000        27613529   525.20
Warsaw      Poland     1740119        29353648   517.00
Vienna     Austria     1805681        22295671   414.60
Munich     Germany     1493900        32449934   310.40
Bucharest  Romania     1803425        24099096   228.00
Milan        Italy     1350680        33800614   181.80
Paris       France     2273305        20489990   105.40
Barcelona    Spain     1602386        30956034   101.90

In [38]:
city_frame = pd.DataFrame(cities,
                          columns=["country", 
                                   "area",
                                   "population"],
                          index=cities["name"])

some_areas = pd.Series([1572, 755, 181.8], 
                    index=['London', 'Hamburg', 'Milan'])

city_frame['area'] = some_areas
print(city_frame)

           country    area  population
London     England  1572.0     8615246
Berlin     Germany     NaN     3562166
Madrid       Spain     NaN     3165235
Rome         Italy     NaN     2874038
Paris       France     NaN     2273305
Vienna     Austria     NaN     1805681
Bucharest  Romania     NaN     1803425
Hamburg    Germany   755.0     1760433
Budapest   Hungary     NaN     1754000
Warsaw      Poland     NaN     1740119
Barcelona    Spain     NaN     1602386
Munich     Germany     NaN     1493900
Milan        Italy   181.8     1350680

In [39]:
city_frame = pd.DataFrame(cities,
                          columns=["country", 
                                   "population"],
                          index=cities["name"])


idx = 1
city_frame.insert(loc=idx, column='area', value=area)
city_frame

           country     area  population
London     England  1572.00     8615246
Berlin     Germany   891.85     3562166
Madrid       Spain   605.77     3165235
Rome         Italy  1285.00     2874038
Paris       France   105.40     2273305
Vienna     Austria   414.60     1805681
Bucharest  Romania   228.00     1803425
Hamburg    Germany   755.00     1760433
Budapest   Hungary   525.20     1754000
Warsaw      Poland   517.00     1740119
Barcelona    Spain   101.90     1602386
Munich     Germany   310.40     1493900
Milan        Italy   181.80     1350680

In [40]:
import pandas as pd
from numpy.random import randint

df = pd.DataFrame(columns=['lib', 'qty1', 'qty2'])
for i in range(5):
     df.loc[i] = ['name' + str(i)] + list(randint(10, size=2))
    
df

     lib  qty1  qty2
0  name0     4     9
1  name1     2     3
2  name2     6     3
3  name3     8     9
4  name4     7     4

In [41]:
growth = {"Switzerland": {"2010": 3.0, "2011": 1.8, "2012": 1.1, "2013": 1.9},
          "Germany": {"2010": 4.1, "2011": 3.6, "2012":	0.4, "2013": 0.1},
          "France": {"2010":2.0,  "2011":2.1, "2012": 0.3, "2013": 0.3},
          "Greece": {"2010":-5.4, "2011":-8.9, "2012":-6.6, "2013":	-3.3},
          "Italy": {"2010":1.7, "2011":	0.6, "2012":-2.3, "2013":-1.9}
          } 
growth_frame = pd.DataFrame(growth)
growth_frame

      Switzerland  Germany  France  Greece  Italy
2010          3.0      4.1     2.0    -5.4    1.7
2011          1.8      3.6     2.1    -8.9    0.6
2012          1.1      0.4     0.3    -6.6   -2.3
2013          1.9      0.1     0.3    -3.3   -1.9

In [42]:
growth_frame.T

             2010  2011  2012  2013
Switzerland   3.0   1.8   1.1   1.9
Germany       4.1   3.6   0.4   0.1
France        2.0   2.1   0.3   0.3
Greece       -5.4  -8.9  -6.6  -3.3
Italy         1.7   0.6  -2.3  -1.9

In [43]:
growth_frame = growth_frame.T

growth_frame2 = growth_frame.reindex(["Switzerland", 
                                      "Italy", 
                                      "Germany", 
                                      "Greece"])
print(growth_frame2)

             2010  2011  2012  2013
Switzerland   3.0   1.8   1.1   1.9
Italy         1.7   0.6  -2.3  -1.9
Germany       4.1   3.6   0.4   0.1
Greece       -5.4  -8.9  -6.6  -3.3

In [44]:
import numpy as np

names = ['Frank', 'Eve', 'Stella', 'Guido', 'Lara']
index = ["January", "February", "March",
         "April", "May", "June",
         "July", "August", "September",
         "October", "November", "December"]
df = pd.DataFrame((np.random.randn(12, 5)*1000).round(2),
                  columns=names,
                  index=index)
df

             Frank      Eve   Stella    Guido    Lara
January     255.95   966.29  1142.61   517.49 -896.50
February   1047.88  -476.88  1794.08  1107.96 -423.27
March       453.78  1494.21   775.66 -1010.47 -227.41
April      -292.14 -1954.41 -1723.43 -1921.64  -47.83
May        -813.91   417.98   -10.78   560.65  234.89
June       1601.40  -452.62  1169.82  -193.45  828.42
July        -20.86   -14.88  -151.57  -547.67  344.60
August     -155.39   975.28  -417.96    30.04 -699.68
September  -324.68  1109.68    68.75  -380.06 -574.61
October     650.12 -1767.22    68.99   169.39  544.56
November   -312.16  1879.09  1432.90    -0.94   40.45
December     16.63 -1978.86  1932.56  2237.53  678.96